/** @file

;******************************************************************************
;* Copyright 2021 Insyde Software Corp. All Rights Reserved.
;*
;* You may not reproduce, distribute, publish, display, perform, modify, adapt,
;* transmit, broadcast, present, recite, release, license or otherwise exploit
;* any part of this publication in any form, by any means, without the prior
;* written permission of Insyde Software Corp.
;*
;******************************************************************************
*/

/=#

#include "Standard.uni"

#string STR_PROCESSOR_VERSION_FORMAT                  #language en-US   "%s\r\n"
#string STR_PROCESSOR_MANUFACTURER_FORMAT             #language en-US   "Manufacturer: %s\r\n"
#string STR_PROCESSOR_ID_FORMAT                       #language en-US   "Processor ID: %s\r\n"
#string STR_CACHE_SIZES_FORMAT                        #language en-US   "L1 Cache Size: %s\r\n"
                                                                        "L2 Cache Size: %s\r\n"
                                                                        "L3 Cache Size: %s\r\n"
// #string STR_SPEED_MHZ_FORMAT                          #language en-US   "%u MHz"
#string STR_PROCESSOR_SUMMARY_FORMAT                  #language en-US   "Total Cores: %u.  Processors: %u.  Current Speed: %s\r\n\r\n"
